package ru.lyubimov.test.kotlin

enum class Mustache {

    USER_OS_NAME, //название ОС пользователя
    CDN, //используемый в данный момент CDN
    AD_SYSTEM, //название рекламной системы
    SRC_URL, // ссылка на файл креатива
    PROJECT_ID,  //идентификатор телепроекта из CMS Витрины
    CLIENT_AD_SEC, // время просмотра рекламы, с момента последней отправки события, в секундах
    EVENT_NAME, //причина отправки события при смене состояния плеера
    AD_WRAPPED, //признак Wrapper (0 - нет, 1 - да)
    SID, // Случайное значение, которое идентифицирует конкретный сеанс работы пользователя с плеером
    CONTENT_SEC, //время просмотра контента, с момента последней отправки события, в секундах
    BLOCK_POS, //позиция в рекламном блоке
    DEVICE_MODEL, //модель устройства
    AD_CLICK, //клик по рекламному материалу
    UID, //идентификатор пользователя
    USER_OS_VER_MAJOR, //мажорная версия ОС
    USER_OS_VER_MINOR, //минорная версия ОС
    DEVICE_VENDOR, //имя устройства
    AD_TITLE, //название рекламного материала
    SEASON_ID, //идентификатор сезона из CMS Витрины
    PROGRAMME_ID, //идентификатор программы из CMS Витрины
    VAST_URL, //начальная ссылка на VAST
    VAST_URL2, //конечная ссылка на VAST, если {{AD_WRAPPED}}
    CREATIVE_ID, //идентификатор креатива
    ERROR_ID, //код ошибки
    ERROR_TITLE, //описание ошибки
    BUFFERING_SEC, //время буферизации плеера, с момента последней отправки события, в секундах
    INIT_SEC, //время инициализации плеера, с момента последней отправки события, в секундах
    BITRATE, //битрейт потока Кбит/сек
    AD_FINAL, //признак последнего креатива в блоке (0 - нет, 1 - да)
    PAUSE_SEC, //время, проведенное в режиме пауза, с момента последней отправки события, в секундах
    DRM, //наличие DRM (0 - нет, 1 - да)
    AD_COUNT, //количество буферизаций плеера, с момента последней отправки события
    BUFFERING_COUNT, //количество буферизаций плеера, с момента последней отправки события
    DEVICE_TYPE, //тип устройства (unknown, desktop, mobile, tablet, TV, STB)
    EVENT_TS, //клиентское время события unixtime по часовому поясу клиента
    CLIENT_AD_BLOCK_SKIP, //отказ от просмотра рекламы (0 - нет, 1 - да)
    SRC_TYPE, //тип креатива MIME
    SDK_VERSION,  //версия плеера
    AD_POSITION, //позиция рекламного блока (preroll, postroll, midroll, pauseroll)
    APPLICATION_NAME, //имя приложения
    IDFA, // рекламный идентификатор
    FTS, //(Frame Time Stamp) для видеоконтента категорий Live, установленная кадру дата-время его прямой трансляции в Интернете (в секундах)
    CLIENT_TIME_ZONE_OFFSET, //временная зона устройства клиента, смещение часового пояса относительно часового пояса UTC в секундах
    STREAM_TS; //текущий таймстамп потока
}

inline fun <reified T : Enum<T>> enumContains(name: String): Boolean {
    return enumValues<T>().any { it.name == name }
}